name: "MNIST Full connect"
layer {
  name: "mnist"
  type: "ImageData"
  top: "scaled"
  top: "label"
  include { phase: TRAIN }
  transform_param {
    scale: 0.00390625
  }
  image_data_param {
    source: "/home/ubuntu/data/training/mnist/train/train.txt"
    is_color: false
    batch_size: 60
    root_folder: "/home/ubuntu/data/training/mnist/"
  }  
}
layer {
  name: "mnist"
  type: "ImageData"
  top: "scaled"
  top: "label"
  include { phase: TEST }
  transform_param {
    scale: 0.00390625
  }
  image_data_param {
    source: "/home/ubuntu/data/training/mnist/test/test.txt"
    is_color: false
    batch_size: 100
    root_folder: "/home/ubuntu/data/training/mnist/"
  }  
}

layer {
  # Use Power layer in deploy phase for input scaling
  name: "scale"
  bottom: "data"
  top: "scaled"
  type: "Power"
  power_param {
    scale: 0.00390625
  }
  include { stage: "deploy" }
}


layer {
  name: "ip1"
  type: "InnerProduct"
  bottom: "scaled"
  top: "ip1"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  inner_product_param {
    num_output: 500
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu1"
  type: "ReLU"
  bottom: "ip1"
  top: "ip1"
}


layer {
  name: "ip2"
  type: "InnerProduct"
  bottom: "ip1"
  top: "ip2"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  inner_product_param {
    num_output: 10
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}

layer {
  name: "accuracy"
  type: "Accuracy"
  bottom: "ip2"
  bottom: "label"
  top: "accuracy"
}

layer {
  name: "loss"
  type: "SoftmaxWithLoss"
  bottom: "ip2"
  bottom: "label"
  top: "loss"
}

layer {
  name: "softmax"
  type: "Softmax"
  bottom: "ip2"
  top: "softmax"
  include { stage: "deploy" }
}
